/*
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⣀⣀⡤⠤⠖⠖⠖⠦⢤⠤⠲⠲⠲⠲⠦⢤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠤⠖⠊⠋⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡰⠚⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢀⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡇⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢀⡴⠊⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⣄⠀⠀⠀⠀⠀⡗⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⡔⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⡶⢤⠤⠚⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⡸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣄⡀⠀⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢠⠇⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣻⡏⠀⠀⠈⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢸⡁⠀⠀⠀⠀⠀⢐⡇⠀⠀⠀⠀⢀⣠⣠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⢺⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠘⡆⠀⠀⠀⠀⠀⡼⠀⠀⠀⠀⠀⢸⣯⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠻⣄⣀⣀⡤⡞⠁⠀⠀⠀⠀⠀⠀⠈⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠁⠁⠀⠸⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢨⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡤⠀⠀⠀⣀⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣆⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⢤⢤⣺⠴⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠦⣤⣀⡀⠀⠀⠀⠀⢀⣀⣄⣿⡾⠾⠋⠋⠱⡄⡯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠉⠛⠛⠋⠋⠉⠉⠈⠀⠀⠀⠀⠀⣸⢣⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡄⠀⢐⡇⠀⠀⠀⠀⠀⠀⠀⠀⢠⠏⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠲⡞⠀⠀⠀⠀⠀⠀⠀⠀⣠⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠶⠴⠴⣆⠀⣴⡀⡯⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠋⠀⠉⠀⠀⠀
*/
#include<cstring>
#include<iostream>
#include<vector>
using namespace std;
int dx[4] = {1, 0, -1, 0};
int dy[4] = {0, -1, 0, 1};
int main() {
    int n;
    cin>>n;
    vector<vector<int>> map(101, vector<int> (101, 0));
    for (int i = 0; i < n; i++) {
        // d: 방향, g: 세대
        int x, y, d, g;
        cin >> x >> y >> d >> g;
        vector<vector<int> > tmp_map(101, vector<int>(101, 0));
        tmp_map[x][y] = 1;
        tmp_map[x + dx[d]][y + dy[d]] = 1;
        // 해당 x, y 가 구심점이 된다
        int turning_x = x + dx[d];
        int turning_y = y + dy[d];
        // cout<<x<<" "<<y<<"\n";
        for (int j = 0; j < g; j++) {
            // cout<<j<<"\n";
            // cout << "t : " << turning_x << " " << turning_y << "\n";
            // px, py 이전의 좌표값
            // nx, ny 90도 시계방향으로 돌린 뒤의 좌표값
            vector<vector<int>> tmp_map1(101, vector<int>(101, 0));
            for (int p_x = 0; p_x <= 100; p_x++) {
                for (int p_y = 0; p_y <= 100; p_y++) {

                    if (tmp_map[p_x][p_y] == 0) continue;
                    // cout <<"p : "<< p_x << " " << p_y << "\n";


                    int N = turning_x - p_x;
                    int M = p_y - turning_y;
                    int nx = turning_x - M;
                    int ny = turning_y - N;
                    if (nx < 0 || ny < 0 || 100 < nx || 100 < ny) continue;
                    tmp_map1[nx][ny] = tmp_map[x][y];
                }
            }

            for (int a=0;a<=100;a++) {
                for (int b=0;b<=100;b++) {
                    tmp_map[a][b] |= tmp_map1[a][b];
                }
            }

            int N = turning_x - x;
            int M = y - turning_y;
            turning_x -= M;
            turning_y -= N;
            // cout << "t : " << turning_x << " " << turning_y << "\n";
            // for (auto &a: tmp_map) {
            //     for (auto &b: a) {
            //         cout<<b<<" ";
            //     }
            //     cout<<"\n";
            // }
            // cout << "\n";

        }
        for (int a=0;a<=100;a++) {
            for (int b=0;b<=100;b++) {
                map[a][b] |= tmp_map[a][b];
            }
        }

    }
    // for (auto &a: map) {
    //     for (auto &b:a) {
    //         cout<<b<<" ";
    //     }
    //     cout<<"\n";
    // }
    // cout<<"\n";

    int result = 0;

    for (int i=0;i<100;i++) {
        for (int j=0;j<100;j++) {
            if (map[i][j] == 0) continue;
            if (
                map[i + 1][j] == 1 &&
                map[i][j + 1] == 1 &&
                map[i + 1][j + 1] == 1
                ) result++;
        }
    }

    cout << result << "\n";
}